#+title: Todo

Work Todos

* DoseSpot [11/11]
** [X] WE-696: DoseSpot V2 JSON
:LOGBOOK:
CLOCK: [2024-06-03 Mon 09:48]--[2024-06-03 Mon 10:13] =>  0:25
:END:
** [X] [[https://hellowisp.atlassian.net/browse/WISPENG-125][WISPENG-125]]: Use 'GetMedicationByNDC' instead of 'GetMedicationByNameAndStrength' for DoseSpot V2
** NO [[https://hellowisp.atlassian.net/browse/WISPENG-260][WISPENG-260]]: Combine "GenericProductName" and "GenericDrugName"
- Note taken on [2024-06-10 Mon 13:20] \\
  Won't do. There is no equivalent for "GenericProductName" in DoseSpot V2.
- Note taken on [2024-06-10 Mon 11:32] \\
  We may not need to do this one, depending on what DoseSpot says.
** [X] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4259][WISPENG-266]]: Adds metadata check in dispensable_drug_id property
- Note taken on [2024-06-07 Fri 15:02] \\
  Currently in draft. Publish it on Monday morning and get reviews.
** [X] Prepare for the DoseSpot call on 2024-06-10 by checking the V1 vs V2 changes for generic product name
:LOGBOOK:
CLOCK: [2024-06-10 Mon 11:18]--[2024-06-10 Mon 11:31] =>  0:13
CLOCK: [2024-06-10 Mon 10:46]--[2024-06-10 Mon 11:11] =>  0:25
CLOCK: [2024-06-10 Mon 10:10]--[2024-06-10 Mon 10:35] =>  0:25
:END:
** [X] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4265][WISPENG-268]]: When getting a medication by RxCUI in V2, ~DrugName~ is null in service response, but not in API JSON response.
:LOGBOOK:
CLOCK: [2024-06-10 Mon 11:52]--[2024-06-10 Mon 12:17] =>  0:25
:END:
- Note taken on [2024-06-10 Mon 11:35] \\
  Need tests for this. Tests should have failed before when this didn't work.
** [X] [[https://hellowisp.atlassian.net/browse/WISPENG-270][WISPENG-270]]: DoseSpotAPIMedicationV2 should accept 'RXCUI' and 'RxCUI'
** [X] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4270][WISPENG-271]]: Adds guard clause to dosespot_drug_metadata property
** [X] Ask if we can get a provider onboard for the DoseSpot launch
- Note taken on [2024-06-20 Thu 14:05] \\
  Andrea will help us out here
** [X] Write a release plan for DoseSpot V2
*** [X] Rollback plan?
*** [X] Schedule of what's going to happen
*** [X] What's important to us?
*** [X] How do we make sure everything worked?
*** [X] Who is going to be doing tests, quick fixes?
*** [X] Section of metrics that we will be watching
**** [X] Find a dashboard in Datadog for fill requests
*** [X] Post-release plan
*** [X] Document the need to change the feature flag
*** [X] Docuement the need to change the subscription key
** [20/20] Document all possible Patient uses of the DoseSpot API
*** [X] CancelPrescription
*** [X] CopyPrescription
*** [X] CreateCodedFillRequestRx
*** [X] CreateFreeTextFillRequestRx
*** [X] CreateOrUpdatePatient
*** [X] DeletePendingRx
*** [X] GetClinicianAddress
*** [X] GetMedicationByNameAndStrength
*** [X] GetMedicationByNDC
*** [X] GetMedicationByRxcui
- Note taken on [2024-06-20 Thu 14:22] \\
  Check ~assert_dosespot_metadata~ usages.
*** [X] GetMedicationMonograph
*** [X] GetNotificationsCounts
*** [X] GetPatientPrescription
*** [X] GetPatientPrescriptions
*** [X] GetPharmacy
*** [X] GetSsoUrl
*** [X] SearchMedicationsByName
*** [X] SearchPharmacies
*** [X] SendPrescriptions
*** [X] UpdatePrescriptionPharmacy
** [X] Document which services need pagination
*** [X] GetPatientPrescriptions
*** [X] SearchMedicationsByName
*** [X] SearchPharmacies
* Misc [2/5]
** [?] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4260][Unticketed PR]] to change SnoozeRequestMixin.missed_calls_count to be non-nullable
** [X] Remove feature flag for disabling DoseSpot API

** [ ] models.Patient.has_synchronous_state can return None
This method should only ever return True or False
** [ ] models.Patient.has_synchronous_state can cause memory leaks because of lru_cache
** [X] Un-fucking my local DB
*** [X] Copying migrations into the new migrations folder
:LOGBOOK:
CLOCK: [2024-08-26 Mon 17:22]--[2024-08-26 Mon 17:47] =>  0:25
:END:
* Editable Medications
** [X] WE-460: New Provider UI
** [X] Investigating UI failure for lab slips
- Note taken on [2024-08-27 Tue 07:06] \\
  Investigation lead to creation of WE-579
** [-] [[https://hellowisp.atlassian.net/browse/WISPENG-579][WISPENG-579]]
:LOGBOOK:
CLOCK: [2024-08-27 Tue 17:00]--[2024-08-27 Tue 18:27] =>  1:27
CLOCK: [2024-08-27 Tue 16:12]--[2024-08-27 Tue 16:37] =>  0:25
CLOCK: [2024-08-27 Tue 14:29]--[2024-08-27 Tue 15:27] =>  0:58
CLOCK: [2024-08-27 Tue 13:59]--[2024-08-27 Tue 14:24] =>  0:25
CLOCK: [2024-08-27 Tue 12:30]--[2024-08-27 Tue 12:42] =>  0:12
CLOCK: [2024-08-27 Tue 11:49]--[2024-08-27 Tue 12:14] =>  0:25
CLOCK: [2024-08-27 Tue 11:19]--[2024-08-27 Tue 11:44] =>  0:25
CLOCK: [2024-08-27 Tue 07:07]--[2024-08-27 Tue 07:32] =>  0:25
:END:
** [-] WE-460 Tests
:LOGBOOK:
CLOCK: [2024-08-26 Mon 15:06]--[2024-08-26 Mon 15:31] =>  0:25
:END:
* Messages to post
** [ ] Ask in dev-private what everyone thinks about the type hint for returning "Self" from Pydantic validators.
We have two options:
- return ~typing_extensions.Self~
- return the same class name in quotes.

It doesn't /really/ matter much, but we should pick one and stick with it.

Note that ~Self~ is part of ~typing~ as of Python 3.11, but for now, we need to use ~typing_extensions~. Only mentioning this in case your IDE suggests importing from ~typing~ (mine did).



* Tests
** [ ] Move tests in tests/api/v3
These tests are misplaced. They should be in tests/app/controllers/api/v3
** [ ] ProductFactory.description should not be None
The DB does not have the column as nullabe, so this should not be ~None~ by default.

